
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>1.分词 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="分词示例.html" />
    
    
    <link rel="prev" href="./" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.2" data-path="分词.html">
            
                <a href="分词.html">
            
                    
                    1.分词
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="分词示例.html">
            
                <a href="分词示例.html">
            
                    
                    1.1 短文本分词示例
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="文本特征.html">
            
                <a href="文本特征.html">
            
                    
                    2.特征
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="tfidf.html">
            
                <a href="tfidf.html">
            
                    
                    2.1 TF-IDF
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="word2vec.html">
            
                <a href="word2vec.html">
            
                    
                    2.2 word2vec
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="文本分类综述.html">
            
                <a href="文本分类综述.html">
            
                    
                    3.文本分类
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="逻辑回归.html">
            
                <a href="逻辑回归.html">
            
                    
                    3.1 逻辑回归分类
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.2" data-path="fastText.html">
            
                <a href="fastText.html">
            
                    
                    3.2 fastText分类
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.3" data-path="CNN.html">
            
                <a href="CNN.html">
            
                    
                    3.3 CNN分类
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.4" data-path="RNN与LSTM.html">
            
                <a href="RNN与LSTM.html">
            
                    
                    3.4 RNN与LSTM分类
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.5" data-path="sms.html">
            
                <a href="sms.html">
            
                    
                    3.5 文本分类的项目
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >1.分词</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x5206;&#x8BCD;">&#x5206;&#x8BCD;</h1>
<p><strong>&#x4E2D;&#x6587;&#x5206;&#x8BCD;</strong>&#x662F;&#x4E2D;&#x6587;&#x81EA;&#x7136;&#x8BED;&#x8A00;&#x5904;&#x7406;&#x7684;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x7684;&#x7EC4;&#x6210;&#x90E8;&#x5206;&#xFF0C;&#x5728;&#x5B66;&#x754C;&#x548C;&#x5DE5;&#x4E1A;&#x754C;&#x90FD;&#x6709;&#x6BD4;&#x8F83;&#x957F;&#x65F6;&#x95F4;&#x7684;&#x7814;&#x7A76;&#x5386;&#x53F2;&#xFF0C;&#x4E5F;&#x6709;&#x4E00;&#x4E9B;&#x6BD4;&#x8F83;&#x6210;&#x719F;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002;</p>
<h2 id="&#x4EC0;&#x4E48;&#x662F;&#x5206;&#x8BCD;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x505A;&#x5206;&#x8BCD;&#xFF1F;">&#x4EC0;&#x4E48;&#x662F;&#x5206;&#x8BCD;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x505A;&#x5206;&#x8BCD;&#xFF1F;</h2>
<p>&#x9996;&#x5148;&#x6211;&#x6765;&#x8BF4;&#x8BF4;&#x4EC0;&#x4E48;&#x662F;&#x8BCD;&#x3002;&#x201C;&#x8BCD;&#x662F;&#x6700;&#x5C0F;&#x7684;&#x80FD;&#x591F;&#x72EC;&#x7ACB;&#x8FD0;&#x7528;&#x7684;&#x8BED;&#x8A00;&#x5355;&#x4F4D;&#x201D;&#xFF0C;&#x90A3;&#x4E48;&#x4EC0;&#x4E48;&#x662F;&#x72EC;&#x7ACB;&#x8FD0;&#x7528;&#x5462;&#xFF1F;&#x5B83;&#x53EF;&#x4EE5;&#x89E3;&#x91CA;&#x4E3A;&#x201C;&#x5355;&#x72EC;&#x505A;&#x53E5;&#x6CD5;&#x6210;&#x5206;&#x6216;&#x5355;&#x72EC;&#x8D77;&#x8BED;&#x6CD5;&#x4F5C;&#x7528;&#x201D;&#x3002;&#x5728;&#x8BED;&#x8A00;&#x5B66;&#x8BED;&#x4E49;&#x5B66;&#x7684;&#x89D2;&#x5EA6;&#x6709;&#x5F88;&#x591A;&#x76F8;&#x5173;&#x7684;&#x7814;&#x7A76;&#x90FD;&#x5BF9;&#x8BCD;&#x7ED9;&#x51FA;&#x4E86;&#x4E00;&#x4E9B;&#x5B9A;&#x4E49;&#x548C;&#x5224;&#x5B9A;&#x6807;&#x6CE8;&#x3002;&#x7136;&#x5F88;&#x591A;&#x4E2D;&#x6587;&#x8BCD;&#x4EC5;&#x7531;&#x5355;&#x4E2A;&#x6C49;&#x5B57;&#x7EC4;&#x6210;&#xFF0C;&#x4F46;&#x662F;&#x66F4;&#x591A;&#x7684;&#x5355;&#x4E2A;&#x6C49;&#x5B57;&#x662F;&#x65E0;&#x6CD5;&#x201C;&#x5355;&#x72EC;&#x505A;&#x53E5;&#x6CD5;&#x6210;&#x5206;&#x6216;&#x5355;&#x72EC;&#x8D77;&#x8BED;&#x6CD5;&#x4F5C;&#x7528;&#x201D;&#x3002;&#x7531;&#x4E8E;&#x56FD;&#x9645;&#x4E0A;&#x5E38;&#x7528;&#x7684;NLP&#x7B97;&#x6CD5;&#xFF0C;&#x6DF1;&#x5C42;&#x6B21;&#x7684;&#x8BED;&#x6CD5;&#x8BED;&#x4E49;&#x5206;&#x6790;&#x901A;&#x5E38;&#x90FD;&#x662F;&#x4EE5;&#x8BCD;&#x4F5C;&#x4E3A;&#x57FA;&#x672C;&#x5355;&#x4F4D;&#xFF0C;&#x5F88;&#x591A;&#x4E2D;&#x6587;&#x7684;&#x81EA;&#x7136;&#x8BED;&#x8A00;&#x5904;&#x7406;&#x7684;&#x4EFB;&#x52A1;&#xFF0C;&#x4E5F;&#x5C31;&#x591A;&#x4E86;&#x4E00;&#x4E2A;&#x9884;&#x5904;&#x7406;&#x7684;&#x8FC7;&#x7A0B;&#x6765;&#x628A;&#x8FDE;&#x7EED;&#x7684;&#x6C49;&#x5B57;&#x5206;&#x9694;&#x6210;&#x66F4;&#x5177;&#x6709;&#x8BED;&#x8A00;&#x8BED;&#x4E49;&#x5B66;&#x4E0A;&#x610F;&#x4E49;&#x7684;&#x8BCD;&#x3002;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x5C31;&#x53EB;&#x505A;&#x5206;&#x8BCD;&#x3002;</p>
<p>&#x8FD9;&#x91CC;&#x6709;&#x4E00;&#x4E2A;&#x4ECE;&#xFF08;Xue 2003) &#x4E2D;&#x62FF;&#x6765;&#x7684;&#x4F8B;&#x5B50;:</p>
<blockquote>
<p>&#x65E5;&#x6587;&#x7AE0;&#x9C7C;&#x600E;&#x4E48;&#x8BF4; &#xFF1D;&#x300B; &#x65E5;&#x6587; &#x7AE0;&#x9C7C; &#x600E;&#x4E48; &#x8BF4; &#xFF1F; &#x65E5; &#x6587;&#x7AE0; &#x9C7C; &#x600E;&#x4E48; &#x8BF4;&#xFF1F;</p>
</blockquote>
<h2 id="&#x5206;&#x8BCD;&#x6709;&#x54EA;&#x4E9B;&#x5E38;&#x89C1;&#x7684;&#x4F20;&#x7EDF;&#x65B9;&#x6CD5;&#xFF1F;">&#x5206;&#x8BCD;&#x6709;&#x54EA;&#x4E9B;&#x5E38;&#x89C1;&#x7684;&#x4F20;&#x7EDF;&#x65B9;&#x6CD5;&#xFF1F;</h2>
<p><strong>&#x8BCD;&#x5178;&#x5339;&#x914D;&#x662F;&#x5206;&#x8BCD;&#x6700;&#x4F20;&#x7EDF;&#x6700;&#x5E38;&#x89C1;&#x7684;&#x4E00;&#x79CD;&#x529E;&#x6CD5;</strong>&#x3002;&#x5373;&#x4FBF;&#x5728;&#x540E;&#x9762;&#x8981;&#x63D0;&#x5230;&#x7684;&#x57FA;&#x4E8E;&#x7EDF;&#x8BA1;&#x5B66;&#x4E60;&#x7684;&#x65B9;&#x6CD5;&#x4E2D;&#xFF0C;&#x8BCD;&#x8868;&#x5339;&#x914D;&#x4E5F;&#x901A;&#x5E38;&#x662F;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x7684;&#x4FE1;&#x606F;&#x6765;&#x6E90;&#xFF08;&#x4EE5;&#x7279;&#x5F81;&#x51FD;&#x6570;&#x7684;&#x5F62;&#x5F0F;&#xFF09;&#x3002;&#x5339;&#x914D;&#x65B9;&#x5F0F;&#x53EF;&#x4EE5;&#x6709;&#x6B63;&#x5411;&#xFF08;&#x4ECE;&#x5DE6;&#x5230;&#x53F3;&#xFF09;&#xFF0C;&#x9006;&#x5411;&#xFF08;&#x4ECE;&#x53F3;&#x5230;&#x5DE6;&#xFF09;&#x3002;&#x5BF9;&#x4E8E;&#x5339;&#x914D;&#x4E2D;&#x9047;&#x5230;&#x7684;&#x591A;&#x79CD;&#x5206;&#x6BB5;&#x53EF;&#x80FD;&#x6027;&#xFF08;segmentation ambiguity&#xFF09;&#xFF0C;&#x901A;&#x5E38;&#x4F1A;&#x9009;&#x53D6;&#x5206;&#x9694;&#x51FA;&#x6765;&#x8BCD;&#x7684;&#x6570;&#x76EE;&#x6700;&#x5C0F;&#x7684;&#x3002;</p>
<p>&#x57FA;&#x4E8E;&#x8BCD;&#x5178;&#x7684;&#x5206;&#x8BCD;&#x7B97;&#x6CD5;&#x662F;&#x5E94;&#x7528;&#x6700;&#x5E7F;&#x6CDB;&#x3001;&#x5206;&#x8BCD;&#x901F;&#x5EA6;&#x6700;&#x5FEB;&#x7684;&#x3002;&#x5F88;&#x957F;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x5185;&#x7814;&#x7A76;&#x8005;&#x90FD;&#x5728;&#x5BF9;&#x57FA;&#x4E8E;&#x5B57;&#x7B26;&#x4E32;&#x5339;&#x914D;&#x65B9;&#x6CD5;&#x8FDB;&#x884C;&#x4F18;&#x5316;&#xFF0C;&#x6BD4;&#x5982;&#x6700;&#x5927;&#x957F;&#x5EA6;&#x8BBE;&#x5B9A;&#x3001;&#x5B57;&#x7B26;&#x4E32;&#x5B58;&#x50A8;&#x548C;&#x67E5;&#x627E;&#x65B9;&#x5F0F;&#x4EE5;&#x53CA;&#x5BF9;&#x4E8E;&#x8BCD;&#x8868;&#x7684;&#x7EC4;&#x7EC7;&#x7ED3;&#x6784;&#xFF0C;&#x6BD4;&#x5982;&#x91C7;&#x7528;TRIE&#x7D22;&#x5F15;&#x6811;&#x3001;&#x54C8;&#x5E0C;&#x7D22;&#x5F15;&#x7B49;&#x3002;</p>
<p>&#x5F88;&#x660E;&#x663E;&#xFF0C;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x5BF9;&#x8BCD;&#x8868;&#x7684;&#x4F9D;&#x8D56;&#x5F88;&#x5927;&#xFF0C;&#x4E00;&#x65E6;&#x51FA;&#x73B0;&#x8BCD;&#x8868;&#x4E2D;&#x4E0D;&#x5B58;&#x5728;&#x7684;&#x65B0;&#x8BCD;&#xFF0C;&#x7B97;&#x6CD5;&#x662F;&#x65E0;&#x6CD5;&#x505A;&#x5230;&#x6B63;&#x786E;&#x7684;&#x5207;&#x5206;&#x7684;&#x3002;&#x4F46;&#x662F;&#x8BCD;&#x8868;&#x5339;&#x914D;&#x4E5F;&#x6709;&#x5B83;&#x7684;&#x4F18;&#x52BF;&#xFF0C;&#x6BD4;&#x5982;&#x7B80;&#x5355;&#x6613;&#x61C2;&#xFF0C;&#x4E0D;&#x4F9D;&#x8D56;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#xFF0C;&#x53EF;&#x4EE5;&#x505A;&#x5230;&#x548C;&#x4E0B;&#x6E38;&#x7684;&#x5E94;&#x7528;&#x7D27;&#x5BC6;&#x7ED3;&#x5408; (&#x673A;&#x5668;&#x7FFB;&#x8BD1;&#x4E2D;&#x7684;phrase table&#xFF0C;TTS&#x4E2D;&#x7684;&#x8BCD;&#x5178;&#x7B49;&#x7B49;)&#xFF0C;&#x6613;&#x4E8E;&#x7EA0;&#x9519;&#x7B49;&#x7B49;&#x3002;</p>
<p><strong>&#x57FA;&#x4E8E;&#x7EDF;&#x8BA1;&#x7684;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#x3002;</strong>&#x8FD9;&#x7C7B;&#x76EE;&#x524D;&#x5E38;&#x7528;&#x7684;&#x662F;&#x7B97;&#x6CD5;&#x662F;HMM&#x3001;CRF&#x3001;SVM&#x3001;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x7B49;&#x7B97;&#x6CD5;&#xFF0C;&#x6BD4;&#x5982;stanford&#x3001;Hanlp&#x5206;&#x8BCD;&#x5DE5;&#x5177;&#x662F;&#x57FA;&#x4E8E;CRF&#x7B97;&#x6CD5;&#x3002;&#x4EE5;CRF&#x4E3A;&#x4F8B;&#xFF0C;&#x57FA;&#x672C;&#x601D;&#x8DEF;&#x662F;&#x5BF9;&#x6C49;&#x5B57;&#x8FDB;&#x884C;&#x6807;&#x6CE8;&#x8BAD;&#x7EC3;&#xFF0C;&#x4E0D;&#x4EC5;&#x8003;&#x8651;&#x4E86;&#x8BCD;&#x8BED;&#x51FA;&#x73B0;&#x7684;&#x9891;&#x7387;&#xFF0C;&#x8FD8;&#x8003;&#x8651;&#x4E0A;&#x4E0B;&#x6587;&#xFF0C;&#x5177;&#x5907;&#x8F83;&#x597D;&#x7684;&#x5B66;&#x4E60;&#x80FD;&#x529B;&#xFF0C;&#x56E0;&#x6B64;&#x5176;&#x5BF9;&#x6B67;&#x4E49;&#x8BCD;&#x548C;&#x672A;&#x767B;&#x5F55;&#x8BCD;&#x7684;&#x8BC6;&#x522B;&#x90FD;&#x5177;&#x6709;&#x826F;&#x597D;&#x7684;&#x6548;&#x679C;</p>
<p>&#x5E38;&#x89C1;&#x7684;&#x5206;&#x8BCD;&#x5668;&#x90FD;&#x662F;&#x4F7F;&#x7528;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#x548C;&#x8BCD;&#x5178;&#x76F8;&#x7ED3;&#x5408;&#xFF0C;&#x4E00;&#x65B9;&#x9762;&#x80FD;&#x591F;&#x63D0;&#x9AD8;&#x5206;&#x8BCD;&#x51C6;&#x786E;&#x7387;&#xFF0C;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#x80FD;&#x591F;&#x6539;&#x5584;&#x9886;&#x57DF;&#x9002;&#x5E94;&#x6027;&#x3002;</p>
<p>&#x968F;&#x7740;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x7684;&#x5174;&#x8D77;&#xFF0C;&#x4E5F;&#x51FA;&#x73B0;&#x4E86;&#x57FA;&#x4E8E;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x5206;&#x8BCD;&#x5668;&#xFF0C;&#x4F8B;&#x5982;&#x6709;&#x4EBA;&#x5458;&#x5C1D;&#x8BD5;&#x4F7F;&#x7528;&#x53CC;&#x5411;LSTM+CRF&#x5B9E;&#x73B0;&#x5206;&#x8BCD;&#x5668;&#xFF0C;&#x5176;&#x672C;&#x8D28;&#x4E0A;&#x662F;&#x5E8F;&#x5217;&#x6807;&#x6CE8;&#xFF0C;&#x6240;&#x4EE5;&#x6709;&#x901A;&#x7528;&#x6027;&#xFF0C;&#x547D;&#x540D;&#x5B9E;&#x4F53;&#x8BC6;&#x522B;&#x7B49;&#x90FD;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x8BE5;&#x6A21;&#x578B;&#xFF0C;&#x636E;&#x62A5;&#x9053;&#x5176;&#x5206;&#x8BCD;&#x5668;&#x5B57;&#x7B26;&#x51C6;&#x786E;&#x7387;&#x53EF;&#x9AD8;&#x8FBE;97.5%&#x3002;&#x7B97;&#x6CD5;&#x6846;&#x67B6;&#x7684;&#x601D;&#x8DEF;&#x4E0E;&#x8BBA;&#x6587;&#x300A;Neural Architectures for Named Entity Recognition&#x300B;&#x7C7B;&#x4F3C;&#xFF0C;&#x5229;&#x7528;&#x8BE5;&#x6846;&#x67B6;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x4E2D;&#x6587;&#x5206;&#x8BCD;&#xFF0C;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#xFF1A;
<img src="img/lstm.jpg" alt="MacDown logo"></p>
<p>&#x9996;&#x5148;&#x5BF9;&#x8BED;&#x6599;&#x8FDB;&#x884C;&#x5B57;&#x7B26;&#x5D4C;&#x5165;&#xFF0C;&#x5C06;&#x5F97;&#x5230;&#x7684;&#x7279;&#x5F81;&#x8F93;&#x5165;&#x7ED9;&#x53CC;&#x5411;LSTM&#xFF0C;&#x7136;&#x540E;&#x52A0;&#x4E00;&#x4E2A;CRF&#x5C31;&#x5F97;&#x5230;&#x6807;&#x6CE8;&#x7ED3;&#x679C;&#x3002;</p>
<h2 id="&#x5206;&#x8BCD;&#x5668;&#x5F53;&#x524D;&#x5B58;&#x5728;&#x95EE;&#x9898;">&#x5206;&#x8BCD;&#x5668;&#x5F53;&#x524D;&#x5B58;&#x5728;&#x95EE;&#x9898;</h2>
<p>&#x76EE;&#x524D;&#x4E2D;&#x6587;&#x5206;&#x8BCD;&#x96BE;&#x70B9;&#x4E3B;&#x8981;&#x6709;&#x4E09;&#x4E2A;&#xFF1A;</p>
<h3 id="1&#x3001;&#x5206;&#x8BCD;&#x6807;&#x51C6;&#xFF1A;">1&#x3001;&#x5206;&#x8BCD;&#x6807;&#x51C6;&#xFF1A;</h3>
<p>&#x6BD4;&#x5982;&#x4EBA;&#x540D;&#xFF0C;&#x5728;&#x54C8;&#x5DE5;&#x5927;&#x7684;&#x6807;&#x51C6;&#x4E2D;&#x59D3;&#x548C;&#x540D;&#x662F;&#x5206;&#x5F00;&#x7684;&#xFF0C;&#x4F46;&#x5728;Hanlp&#x4E2D;&#x662F;&#x5408;&#x5728;&#x4E00;&#x8D77;&#x7684;&#x3002;&#x8FD9;&#x9700;&#x8981;&#x6839;&#x636E;&#x4E0D;&#x540C;&#x7684;&#x9700;&#x6C42;&#x5236;&#x5B9A;&#x4E0D;&#x540C;&#x7684;&#x5206;&#x8BCD;&#x6807;&#x51C6;&#x3002;</p>
<h3 id="2&#x3001;&#x6B67;&#x4E49;&#xFF1A;">2&#x3001;&#x6B67;&#x4E49;&#xFF1A;</h3>
<p>&#x5BF9;&#x540C;&#x4E00;&#x4E2A;&#x5F85;&#x5207;&#x5206;&#x5B57;&#x7B26;&#x4E32;&#x5B58;&#x5728;&#x591A;&#x4E2A;&#x5206;&#x8BCD;&#x7ED3;&#x679C;&#x3002;&#x6B67;&#x4E49;&#x53C8;&#x5206;&#x4E3A;&#x7EC4;&#x5408;&#x578B;&#x6B67;&#x4E49;&#x3001;&#x4EA4;&#x96C6;&#x578B;&#x6B67;&#x4E49;&#x548C;&#x771F;&#x6B67;&#x4E49;&#x4E09;&#x79CD;&#x7C7B;&#x578B;&#x3002;</p>
<p>1) &#x7EC4;&#x5408;&#x578B;&#x6B67;&#x4E49;&#xFF1A;&#x5206;&#x8BCD;&#x662F;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x7C92;&#x5EA6;&#x7684;&#xFF0C;&#x6307;&#x67D0;&#x4E2A;&#x8BCD;&#x6761;&#x4E2D;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x4E5F;&#x53EF;&#x4EE5;&#x5207;&#x5206;&#x4E3A;&#x4E00;&#x4E2A;&#x72EC;&#x7ACB;&#x7684;&#x8BCD;&#x6761;&#x3002;&#x6BD4;&#x5982;&#x201C;&#x4E2D;&#x534E;&#x4EBA;&#x6C11;&#x5171;&#x548C;&#x56FD;&#x201D;&#xFF0C;&#x7C97;&#x7C92;&#x5EA6;&#x7684;&#x5206;&#x8BCD;&#x5C31;&#x662F;&#x201C;&#x4E2D;&#x534E;&#x4EBA;&#x6C11;&#x5171;&#x548C;&#x56FD;&#x201D;&#xFF0C;&#x7EC6;&#x7C92;&#x5EA6;&#x7684;&#x5206;&#x8BCD;&#x53EF;&#x80FD;&#x662F;&#x201C;&#x4E2D;&#x534E;/&#x4EBA;&#x6C11;/&#x5171;&#x548C;&#x56FD;&#x201D;</p>
<p>2) &#x4EA4;&#x96C6;&#x578B;&#x6B67;&#x4E49;&#xFF1A;&#x5728;&#x201C;&#x90D1;&#x5DDE;&#x5929;&#x548C;&#x670D;&#x88C5;&#x5382;&#x201D;&#x4E2D;&#xFF0C;&#x201C;&#x5929;&#x548C;&#x201D;&#x662F;&#x5382;&#x540D;&#xFF0C;&#x662F;&#x4E00;&#x4E2A;&#x4E13;&#x6709;&#x8BCD;&#xFF0C;&#x201C;&#x548C;&#x670D;&#x201D;&#x4E5F;&#x662F;&#x4E00;&#x4E2A;&#x8BCD;&#xFF0C;&#x5B83;&#x4EEC;&#x5171;&#x7528;&#x4E86;&#x201C;&#x548C;&#x201D;&#x5B57;&#x3002;</p>
<p>3) &#x771F;&#x6B67;&#x4E49;&#xFF1A;&#x672C;&#x8EAB;&#x7684;&#x8BED;&#x6CD5;&#x548C;&#x8BED;&#x4E49;&#x90FD;&#x6CA1;&#x6709;&#x95EE;&#x9898;, &#x5373;&#x4FBF;&#x91C7;&#x7528;&#x4EBA;&#x5DE5;&#x5207;&#x5206;&#x4E5F;&#x4F1A;&#x4EA7;&#x751F;&#x540C;&#x6837;&#x7684;&#x6B67;&#x4E49;&#xFF0C;&#x53EA;&#x6709;&#x901A;&#x8FC7;&#x4E0A;&#x4E0B;&#x6587;&#x7684;&#x8BED;&#x4E49;&#x73AF;&#x5883;&#x624D;&#x80FD;&#x7ED9;&#x51FA;&#x6B63;&#x786E;&#x7684;&#x5207;&#x5206;&#x7ED3;&#x679C;&#x3002;&#x4F8B;&#x5982;&#xFF1A;&#x5BF9;&#x4E8E;&#x53E5;&#x5B50;&#x201C;&#x7F8E;&#x56FD;&#x4F1A;&#x901A;&#x8FC7;&#x5BF9;&#x53F0;&#x552E;&#x6B66;&#x6CD5;&#x6848;&#x201D;&#xFF0C;&#x65E2;&#x53EF;&#x4EE5;&#x5207;&#x5206;&#x6210;&#x201C;&#x7F8E;&#x56FD;/&#x4F1A;/&#x901A;&#x8FC7;&#x5BF9;&#x53F0;&#x552E;&#x6B66;&#x6CD5;&#x6848;&#x201D;&#xFF0C;&#x53C8;&#x53EF;&#x4EE5;&#x5207;&#x5206;&#x6210;&#x201C;&#x7F8E;/&#x56FD;&#x4F1A;/&#x901A;&#x8FC7;&#x5BF9;&#x53F0;&#x552E;&#x6B66;&#x6CD5;&#x6848;&#x201D;&#x3002;</p>
<h2 id="&#x7ED3;&#x5DF4;&#x5206;&#x8BCD;">&#x7ED3;&#x5DF4;&#x5206;&#x8BCD;</h2>
<h1 id="jieba">jieba</h1>
<p>&#x201C;&#x7ED3;&#x5DF4;&#x201D;&#x4E2D;&#x6587;&#x5206;&#x8BCD;&#xFF1A;&#x505A;&#x6700;&#x597D;&#x7684; Python &#x4E2D;&#x6587;&#x5206;&#x8BCD;&#x7EC4;&#x4EF6;</p>
<h1 id="&#x7279;&#x70B9;">&#x7279;&#x70B9;</h1>
<ul>
<li><p>&#x652F;&#x6301;&#x4E09;&#x79CD;&#x5206;&#x8BCD;&#x6A21;&#x5F0F;&#xFF1A;</p>
<ul>
<li>&#x7CBE;&#x786E;&#x6A21;&#x5F0F;&#xFF0C;&#x8BD5;&#x56FE;&#x5C06;&#x53E5;&#x5B50;&#x6700;&#x7CBE;&#x786E;&#x5730;&#x5207;&#x5F00;&#xFF0C;&#x9002;&#x5408;&#x6587;&#x672C;&#x5206;&#x6790;&#xFF1B;</li>
<li>&#x5168;&#x6A21;&#x5F0F;&#xFF0C;&#x628A;&#x53E5;&#x5B50;&#x4E2D;&#x6240;&#x6709;&#x7684;&#x53EF;&#x4EE5;&#x6210;&#x8BCD;&#x7684;&#x8BCD;&#x8BED;&#x90FD;&#x626B;&#x63CF;&#x51FA;&#x6765;, &#x901F;&#x5EA6;&#x975E;&#x5E38;&#x5FEB;&#xFF0C;&#x4F46;&#x662F;&#x4E0D;&#x80FD;&#x89E3;&#x51B3;&#x6B67;&#x4E49;&#xFF1B;</li>
<li>&#x641C;&#x7D22;&#x5F15;&#x64CE;&#x6A21;&#x5F0F;&#xFF0C;&#x5728;&#x7CBE;&#x786E;&#x6A21;&#x5F0F;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#xFF0C;&#x5BF9;&#x957F;&#x8BCD;&#x518D;&#x6B21;&#x5207;&#x5206;&#xFF0C;&#x63D0;&#x9AD8;&#x53EC;&#x56DE;&#x7387;&#xFF0C;&#x9002;&#x5408;&#x7528;&#x4E8E;&#x641C;&#x7D22;&#x5F15;&#x64CE;&#x5206;&#x8BCD;&#x3002;</li>
</ul>
</li>
<li><p>&#x652F;&#x6301;&#x7E41;&#x4F53;&#x5206;&#x8BCD;</p>
</li>
<li>&#x652F;&#x6301;&#x81EA;&#x5B9A;&#x4E49;&#x8BCD;&#x5178;</li>
<li>MIT &#x6388;&#x6743;&#x534F;&#x8BAE;</li>
</ul>
<h1 id="&#x4E3B;&#x8981;&#x529F;&#x80FD;">&#x4E3B;&#x8981;&#x529F;&#x80FD;</h1>
<h2 id="1-&#x5206;&#x8BCD;">1. &#x5206;&#x8BCD;</h2>
<ul>
<li><code>jieba.cut</code> &#x65B9;&#x6CD5;&#x63A5;&#x53D7;&#x4E09;&#x4E2A;&#x8F93;&#x5165;&#x53C2;&#x6570;: &#x9700;&#x8981;&#x5206;&#x8BCD;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#xFF1B;cut_all &#x53C2;&#x6570;&#x7528;&#x6765;&#x63A7;&#x5236;&#x662F;&#x5426;&#x91C7;&#x7528;&#x5168;&#x6A21;&#x5F0F;&#xFF1B;HMM &#x53C2;&#x6570;&#x7528;&#x6765;&#x63A7;&#x5236;&#x662F;&#x5426;&#x4F7F;&#x7528; HMM &#x6A21;&#x578B;</li>
<li><code>jieba.cut_for_search</code> &#x65B9;&#x6CD5;&#x63A5;&#x53D7;&#x4E24;&#x4E2A;&#x53C2;&#x6570;&#xFF1A;&#x9700;&#x8981;&#x5206;&#x8BCD;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#xFF1B;&#x662F;&#x5426;&#x4F7F;&#x7528; HMM &#x6A21;&#x578B;&#x3002;&#x8BE5;&#x65B9;&#x6CD5;&#x9002;&#x5408;&#x7528;&#x4E8E;&#x641C;&#x7D22;&#x5F15;&#x64CE;&#x6784;&#x5EFA;&#x5012;&#x6392;&#x7D22;&#x5F15;&#x7684;&#x5206;&#x8BCD;&#xFF0C;&#x7C92;&#x5EA6;&#x6BD4;&#x8F83;&#x7EC6;</li>
<li>&#x5F85;&#x5206;&#x8BCD;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x53EF;&#x4EE5;&#x662F; unicode &#x6216; UTF-8 &#x5B57;&#x7B26;&#x4E32;&#x3001;GBK &#x5B57;&#x7B26;&#x4E32;&#x3002;&#x6CE8;&#x610F;&#xFF1A;&#x4E0D;&#x5EFA;&#x8BAE;&#x76F4;&#x63A5;&#x8F93;&#x5165; GBK &#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x53EF;&#x80FD;&#x65E0;&#x6CD5;&#x9884;&#x6599;&#x5730;&#x9519;&#x8BEF;&#x89E3;&#x7801;&#x6210; UTF-8</li>
<li><code>jieba.cut</code> &#x4EE5;&#x53CA; <code>jieba.cut_for_search</code> &#x8FD4;&#x56DE;&#x7684;&#x7ED3;&#x6784;&#x90FD;&#x662F;&#x4E00;&#x4E2A;&#x53EF;&#x8FED;&#x4EE3;&#x7684; generator&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528; for &#x5FAA;&#x73AF;&#x6765;&#x83B7;&#x5F97;&#x5206;&#x8BCD;&#x540E;&#x5F97;&#x5230;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#x8BCD;&#x8BED;(unicode)&#xFF0C;&#x6216;&#x8005;&#x7528;</li>
<li><code>jieba.lcut</code> &#x4EE5;&#x53CA; <code>jieba.lcut_for_search</code> &#x76F4;&#x63A5;&#x8FD4;&#x56DE; list</li>
<li><code>jieba.Tokenizer(dictionary=DEFAULT_DICT)</code> &#x65B0;&#x5EFA;&#x81EA;&#x5B9A;&#x4E49;&#x5206;&#x8BCD;&#x5668;&#xFF0C;&#x53EF;&#x7528;&#x4E8E;&#x540C;&#x65F6;&#x4F7F;&#x7528;&#x4E0D;&#x540C;&#x8BCD;&#x5178;&#x3002;<code>jieba.dt</code> &#x4E3A;&#x9ED8;&#x8BA4;&#x5206;&#x8BCD;&#x5668;&#xFF0C;&#x6240;&#x6709;&#x5168;&#x5C40;&#x5206;&#x8BCD;&#x76F8;&#x5173;&#x51FD;&#x6570;&#x90FD;&#x662F;&#x8BE5;&#x5206;&#x8BCD;&#x5668;&#x7684;&#x6620;&#x5C04;&#x3002;</li>
</ul>
<p>&#x4EE3;&#x7801;&#x793A;&#x4F8B;</p>
<pre><code class="lang-python"><span class="hljs-comment"># encoding=utf-8</span>
<span class="hljs-keyword">import</span> jieba

seg_list = jieba.cut(<span class="hljs-string">&quot;&#x5206;&#x8BCD;&#x662F;&#x4E2D;&#x6587;&#x81EA;&#x7136;&#x8BED;&#x8A00;&#x5904;&#x7406;&#x7684;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x7684;&#x7EC4;&#x6210;&#x90E8;&#x5206;&quot;</span>, cut_all=<span class="hljs-keyword">True</span>)
print(<span class="hljs-string">&quot;Full Mode: &quot;</span> + <span class="hljs-string">&quot;/ &quot;</span>.join(seg_list))  <span class="hljs-comment"># &#x5168;&#x6A21;&#x5F0F;</span>

seg_list = jieba.cut(<span class="hljs-string">&quot;&#x5206;&#x8BCD;&#x662F;&#x4E2D;&#x6587;&#x81EA;&#x7136;&#x8BED;&#x8A00;&#x5904;&#x7406;&#x7684;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x7684;&#x7EC4;&#x6210;&#x90E8;&#x5206;&quot;</span>, cut_all=<span class="hljs-keyword">False</span>)
print(<span class="hljs-string">&quot;Default Mode: &quot;</span> + <span class="hljs-string">&quot;/ &quot;</span>.join(seg_list))  <span class="hljs-comment"># &#x7CBE;&#x786E;&#x6A21;&#x5F0F;</span>

seg_list = jieba.cut(<span class="hljs-string">&quot;&#x5206;&#x8BCD;&#x662F;&#x4E2D;&#x6587;&#x81EA;&#x7136;&#x8BED;&#x8A00;&#x5904;&#x7406;&#x7684;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x7684;&#x7EC4;&#x6210;&#x90E8;&#x5206;&quot;</span>)  <span class="hljs-comment"># &#x9ED8;&#x8BA4;&#x662F;&#x7CBE;&#x786E;&#x6A21;&#x5F0F;</span>
print(<span class="hljs-string">&quot;, &quot;</span>.join(seg_list))

seg_list = jieba.cut_for_search(<span class="hljs-string">&quot;&#x5206;&#x8BCD;&#x662F;&#x4E2D;&#x6587;&#x81EA;&#x7136;&#x8BED;&#x8A00;&#x5904;&#x7406;&#x7684;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x7684;&#x7EC4;&#x6210;&#x90E8;&#x5206;&quot;</span>)  <span class="hljs-comment"># &#x641C;&#x7D22;&#x5F15;&#x64CE;&#x6A21;&#x5F0F;</span>
print(<span class="hljs-string">&quot;, &quot;</span>.join(seg_list))
</code></pre>
<p>&#x8F93;&#x51FA;:</p>
<pre><code>Full Mode: &#x5206;&#x8BCD;/ &#x662F;/ &#x4E2D;&#x6587;/ &#x81EA;&#x7136;/ &#x81EA;&#x7136;&#x8BED;&#x8A00;/ &#x8BED;&#x8A00;/ &#x5904;&#x7406;/ &#x7684;/ &#x4E00;&#x4E2A;/ &#x975E;&#x5E38;/ &#x91CD;&#x8981;/ &#x7684;/ &#x7EC4;&#x6210;/ &#x7EC4;&#x6210;&#x90E8;&#x5206;/ &#x90E8;&#x5206;
Default Mode: &#x5206;&#x8BCD;/ &#x662F;/ &#x4E2D;&#x6587;/ &#x81EA;&#x7136;&#x8BED;&#x8A00;/ &#x5904;&#x7406;/ &#x7684;/ &#x4E00;&#x4E2A;/ &#x975E;&#x5E38;/ &#x91CD;&#x8981;/ &#x7684;/ &#x7EC4;&#x6210;&#x90E8;&#x5206;
&#x5206;&#x8BCD;, &#x662F;, &#x4E2D;&#x6587;, &#x81EA;&#x7136;&#x8BED;&#x8A00;, &#x5904;&#x7406;, &#x7684;, &#x4E00;&#x4E2A;, &#x975E;&#x5E38;, &#x91CD;&#x8981;, &#x7684;, &#x7EC4;&#x6210;&#x90E8;&#x5206;
&#x5206;&#x8BCD;, &#x662F;, &#x4E2D;&#x6587;, &#x81EA;&#x7136;, &#x8BED;&#x8A00;, &#x81EA;&#x7136;&#x8BED;&#x8A00;, &#x5904;&#x7406;, &#x7684;, &#x4E00;&#x4E2A;, &#x975E;&#x5E38;, &#x91CD;&#x8981;, &#x7684;, &#x7EC4;&#x6210;, &#x90E8;&#x5206;, &#x7EC4;&#x6210;&#x90E8;&#x5206;
</code></pre><h2 id="2-&#x6DFB;&#x52A0;&#x81EA;&#x5B9A;&#x4E49;&#x8BCD;&#x5178;">2. &#x6DFB;&#x52A0;&#x81EA;&#x5B9A;&#x4E49;&#x8BCD;&#x5178;</h2>
<h3 id="&#x8F7D;&#x5165;&#x8BCD;&#x5178;">&#x8F7D;&#x5165;&#x8BCD;&#x5178;</h3>
<ul>
<li>&#x5F00;&#x53D1;&#x8005;&#x53EF;&#x4EE5;&#x6307;&#x5B9A;&#x81EA;&#x5DF1;&#x81EA;&#x5B9A;&#x4E49;&#x7684;&#x8BCD;&#x5178;&#xFF0C;&#x4EE5;&#x4FBF;&#x5305;&#x542B; jieba &#x8BCD;&#x5E93;&#x91CC;&#x6CA1;&#x6709;&#x7684;&#x8BCD;&#x3002;&#x867D;&#x7136; jieba &#x6709;&#x65B0;&#x8BCD;&#x8BC6;&#x522B;&#x80FD;&#x529B;&#xFF0C;&#x4F46;&#x662F;&#x81EA;&#x884C;&#x6DFB;&#x52A0;&#x65B0;&#x8BCD;&#x53EF;&#x4EE5;&#x4FDD;&#x8BC1;&#x66F4;&#x9AD8;&#x7684;&#x6B63;&#x786E;&#x7387;</li>
<li>&#x7528;&#x6CD5;&#xFF1A; jieba.load_userdict(file_name) # file_name &#x4E3A;&#x6587;&#x4EF6;&#x7C7B;&#x5BF9;&#x8C61;&#x6216;&#x81EA;&#x5B9A;&#x4E49;&#x8BCD;&#x5178;&#x7684;&#x8DEF;&#x5F84;</li>
<li>&#x8BCD;&#x5178;&#x683C;&#x5F0F;&#x548C; <code>dict.txt</code> &#x4E00;&#x6837;&#xFF0C;&#x4E00;&#x4E2A;&#x8BCD;&#x5360;&#x4E00;&#x884C;&#xFF1B;&#x6BCF;&#x4E00;&#x884C;&#x5206;&#x4E09;&#x90E8;&#x5206;&#xFF1A;&#x8BCD;&#x8BED;&#x3001;&#x8BCD;&#x9891;&#xFF08;&#x53EF;&#x7701;&#x7565;&#xFF09;&#x3001;&#x8BCD;&#x6027;&#xFF08;&#x53EF;&#x7701;&#x7565;&#xFF09;&#xFF0C;&#x7528;&#x7A7A;&#x683C;&#x9694;&#x5F00;&#xFF0C;&#x987A;&#x5E8F;&#x4E0D;&#x53EF;&#x98A0;&#x5012;&#x3002;<code>file_name</code> &#x82E5;&#x4E3A;&#x8DEF;&#x5F84;&#x6216;&#x4E8C;&#x8FDB;&#x5236;&#x65B9;&#x5F0F;&#x6253;&#x5F00;&#x7684;&#x6587;&#x4EF6;&#xFF0C;&#x5219;&#x6587;&#x4EF6;&#x5FC5;&#x987B;&#x4E3A; UTF-8 &#x7F16;&#x7801;&#x3002;</li>
<li>&#x8BCD;&#x9891;&#x7701;&#x7565;&#x65F6;&#x4F7F;&#x7528;&#x81EA;&#x52A8;&#x8BA1;&#x7B97;&#x7684;&#x80FD;&#x4FDD;&#x8BC1;&#x5206;&#x51FA;&#x8BE5;&#x8BCD;&#x7684;&#x8BCD;&#x9891;&#x3002;</li>
</ul>
<p><strong>&#x4F8B;&#x5982;&#xFF1A;</strong></p>
<pre><code>&#x91CF;&#x5316;&#x6D3E;
</code></pre><ul>
<li><p>&#x8303;&#x4F8B;&#xFF1A;</p>
<ul>
<li><p>&#x81EA;&#x5B9A;&#x4E49;&#x8BCD;&#x5178;&#xFF1A;<a href="https://github.com/fxsjy/jieba/blob/master/test/userdict.txt" target="_blank">https://github.com/fxsjy/jieba/blob/master/test/userdict.txt</a></p>
</li>
<li><p>&#x7528;&#x6CD5;&#x793A;&#x4F8B;&#xFF1A;<a href="https://github.com/fxsjy/jieba/blob/master/test/test_userdict.py" target="_blank">https://github.com/fxsjy/jieba/blob/master/test/test_userdict.py</a></p>
<pre><code> * &#x4E4B;&#x524D;&#xFF1A; &#x91CF;&#x5316;/ &#x6D3E;&#x98CE;/ &#x63A7;&#x7EC4;/ &#x7684;/ &#x5C0F;&#x9A6C;&#x54E5;/ &#x4EE3;&#x7801;/ &#x80FD;&#x529B;/ &#x5F3A;
</code></pre><ul>
<li>&#x52A0;&#x8F7D;&#x81EA;&#x5B9A;&#x4E49;&#x8BCD;&#x5E93;&#x540E;&#xFF1A;&#x3000;&#x91CF;&#x5316;&#x6D3E;/ &#x98CE;&#x63A7;&#x7EC4;/ &#x7684;/ &#x5C0F;&#x9A6C;&#x54E5;/ &#x4EE3;&#x7801;/ &#x80FD;&#x529B;/ &#x5F3A;</li>
</ul>
</li>
</ul>
</li>
</ul>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="./" class="navigation navigation-prev " aria-label="Previous page: Introduction">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="分词示例.html" class="navigation navigation-next " aria-label="Next page: 1.1 短文本分词示例">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"1.分词","level":"1.2","depth":1,"next":{"title":"1.1 短文本分词示例","level":"1.2.1","depth":2,"path":"分词示例.md","ref":"分词示例.md","articles":[]},"previous":{"title":"Introduction","level":"1.1","depth":1,"path":"README.md","ref":"README.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["livereload"],"pluginsConfig":{"livereload":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"分词.md","mtime":"2018-10-10T11:41:18.634Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-11-29T06:50:23.684Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

